package test;

import java.util.Date;
import java.util.Random;

import org.junit.Test;

import blog.article.dao.ArticleDao;
import blog.article.domain.Article;
import blog.user.dao.UserDao;
import blog.user.domain.User;
import blog.utils.commons.CommonUtils;
import blog.utils.encryption.Encryption;

public class BlogTest {
	private UserDao userDao = new UserDao();

	@Test
	public void testAddUser() {
		/*String[] strs = { "zhangsan", "lisi", "wangwu", "zhaoliu", "xiaoqi" };
		for (String string : strs) {
			userDao.add(getUser(string));
		}*/
		userDao.add(getUser("admin"));

	}

	public User getUser(String str) {
		String uid = CommonUtils.uuid();
		String email = str + "@qq.com";
		String username = str;
		String password = Encryption.getMD5("123456789");
		String school = "河海大学常州校区";
		String qualification = "本科";	//最高学历
		String graduationYear = "2019";	//毕业年份
		String specialisations = "Java工程师";	//感兴趣的职业方向
		String sex = "男";
		String ubrief = "既然选择了远方，那便只顾风雨兼程！";			//个人简介
		String domicile = "常州";		//居住地
		String token = CommonUtils.uuid() + CommonUtils.uuid();			//激活码
		boolean state = true;	//激活状态
		int admin = 0;			//用户权限

		User user = new User(uid, email, username, password, school, qualification,
				graduationYear, specialisations, sex, ubrief, domicile, token, state,
				admin);

		return user;
	}

	public User getUserByUserName(String username) {
		return userDao.findByUsername(username);
	}

	private ArticleDao artileDao = new ArticleDao();
	private MyArticle[] myArticles = new MyArticle[10];

	@Test
	public void name() {
		createMyAticles();
		for (MyArticle myArticle : myArticles) {
			System.out.println(myArticle.getTitle());
		}
	}

	@Test
	public void testAddArticle() throws InterruptedException {
		createMyAticles();
		Random random = new Random();
		String[] strs = { "zhangsan", "lisi", "wangwu", "zhaoliu", "xiaoqi" };
		String[] clafys = { "Java高级开发", "数据库", "软件工程", "算法与数据结构", "C语言", "C++" };
		for (String username : strs) {
			for (int i = 33; i > 0; i--) {
				MyArticle myArticle = myArticles[random.nextInt(10)];
				Article article = getArticle(username, myArticle.getTitle(),
						myArticle.getContent(), clafys[random.nextInt(6)]);
				artileDao.addArticle(article);
				Thread.sleep(100);
			}
		}
	}

	public void createMyAticles() {
		String con0 = "今夜\n" + "做一片叶子\n" + "有随风而落的自由\n" + "叶脉里有我 轻轻\n" + "抱紧的温柔\n" + "\n"
				+ "把遇见的人\n" + "叫过我名字的\n" + "都在脉边的纹路里\n" + "细细的刻画\n" + "\n" + "再把 思念分两半\n"
				+ "一半是手边的冬季\n" + "一半是你说过的\n" + "温暖的话\n" + "\n" + "冬夜里\n" + "有些风缓缓吹过\n"
				+ "你种的那棵树\n" + "开满了花\n";
		myArticles[0] = new MyArticle("冬至", con0);

		String con1 = "北风翻卷着枯叶，\n" + "涤荡着沟壑，\n" + "漫天的尘土，\n" + "诠释着适者生存的法则。\n" + "一株新绿，\n"
				+ "倦出着羸弱的身躯，\n" + "挣脱了土地的干涸，\n" + "带着希望的亮色，\n" + "展现出优美的羞涩，\n"
				+ "在风中不停地摇曳，\n" + "几次落入黄沙的恶口，\n" + "又数次偷偷潜出点滴翠波。\n" + "这是生命的顽强，\n"
				+ "也是前行者的脊梁，\n" + "任凭风刀雪剑，\n" + "依晰听见的还是你对春的吟唱，\n" + "虽不慷慨激昂，\n"
				+ "但也充满对葱郁的无尽向往。";
		myArticles[1] = new MyArticle("绿色的向往", con1);

		String con2 =
				"我小时候的记忆不见了，记忆是从七岁时开始的，这年，我八岁刚读二年级，刚放学，我和其他的二年级小学生一样的收拾书包，跑出教室，带着好似开心的神色扑到了在外等候的母亲身上。\n"
						+ "回到家中，邻居有几个小孩，我们经常一起玩耍，此时，大家玩着扮家家酒，在其中我非常的耀眼，秀气的脸上时刻带着阳光的笑容，两个小男孩和两个小女孩再加上我，两个小男孩一个胖一个瘦，瘦的那个还有点帅，胖的那个就不怎么样了。\n"
						+ "两个小男孩此时已经都是八岁了，已经有男女意识了，再加上家中父母的教导，他们用自认为很有绅士气质的说道“小青，小白，你们来选让谁当父亲。”我听着他们的话，随大众的点点头。\n"
						+ "”小凌，你当爸爸，我当妈妈吧。“两个小女孩中较为漂亮的女孩有些胆怯的说道。\n"
						+ "”好啊！”我笑着说道，另外一个小女孩选了瘦的当了爸爸，胖男孩脸上带着愤怒，他可没有大人那种心机，只要有了愤怒表现出来就是了，愤怒的他看着我，“哼，都是你，没有人选我。”在他看来这个笑的很好看的人是罪魁祸首，他用力一推，我啪的一声摔了个四脚朝天。\n"
						+ "瘦弱的我被体型健壮的他这么一推，身上许多处都是剧痛，但这时，我的脸上没有一滴眼泪，甚至有些茫然，虽然感到自己身上的痛觉，我却不知道此时应该干什么，两个男孩早就逃之夭夭了，两个小女孩一脸惊慌的看着我，她们觉得我现在应该哭了啊？\n"
						+ "天生对于感情敏锐的我，看出了她们眼中的疑惑，“你们为什么这样看我”我一脸笑容的说道。\n"
						+ "“小凌，你好勇敢啊！我要是像你这样，我早就哭了。”漂亮小女孩一脸崇拜的说道。\n"
						+ "我看着小女孩，听着她的话，“我要哭吗？”我喃喃道，看过其他人哭过的我自然是明白这是什么情绪，眼中闪过明悟，我的心中好像有了什么，又好象没有。\n"
						+ "此时，我的眼睛有些朦胧，眼睛中有着泪水，“小凌，你怎么哭了？”小女孩惊讶的问道。\n"
						+ "“我哭了吗？不，我这是开心。”将泪水擦光，此时，我笑了，笑的比往常更加真实。";
		myArticles[2] = new MyArticle("成长之路", con2);

		String con3 = "羞涩， 纯真 				  \n" + "有人说，是青春留给余生的念   \n"
				+ "而，我们的开始               \n" + "也和其他人一样               \n"
				+ "遇见她，是我最好的时光搭线   \n" + "珍惜她，是你开口回答我愿意   \n" + "青春的诺言证明了爱情         \n"
				+ "你说                         \n" + "糖果的颜色如同你喜欢的彩虹   \n"
				+ "我哼唱着歌曲你流下了眼泪     \n" + "你说                         \n"
				+ "这一首歌词写下了以后轮年     \n" + "我们一起老去的画面           \n"
				+ "幸福 满足 自傲               \n" + "其实，我们的距离很遥远       \n"
				+ "其实，早安晚安很简单         \n" + "其实，逝年是遗忘的分开       \n"
				+ "而我从开始到结局             \n" + "就没考虑过失去你             \n"
				+ "                             \n" + "这一封，没签署名的信笺       \n"
				+ "希望你可以看到               \n";
		myArticles[3] = new MyArticle("青春的信笺", con3);

		String con4 = "当这一切充塞过来，是极其生动感染的真传     \n" + "喜鹊将古老的音符，谱成新歌向我朝喧         \n"
				+ "小样的麻雀，欢跃着，唧唧着在和弦           \n" + "错落的草木，仰起寒冷蔫落的头冠挺出抖擞     \n"
				+ "而风仍以寒者的身份，行走在季节的凋残       \n" + "新记忆中的雪，没能掩藏住萧瑟的锈斑         \n"
				+ "可我所闻到的暗香，倒有全新的生鲜           \n"
				+ "－                                         \n"
				+ "当很多的笑脸，频频地投上我的窗前           \n" + "我凝视着这片画面，耳聆着这些动听的声音     \n"
				+ "在画与音的互动中，心中升起一枚航帆         \n" + "企想在高远之间，在时光流逝之间             \n"
				+ "去洞穿那些山峦，水流，荒野与沙滩           \n" + "及至，可以砸碎一个城市角落上的栅栏         \n"
				+ "扶起一条逶迤在乡村的泥路与田阡             \n" + "不虚构，不童话，凭心绪来编织春天           \n"
				+ "－                                         \n"
				+ "当我难以预料，冬至夜在有喜鹊的点燃         \n" + "可否清晰我一个梦想致远的答案时             \n"
				+ "我无法回答，霓虹灯下的车流能否悠闲         \n" + "急匆匆的脚步，会否有疲倦的气喘             \n"
				+ "锅碗瓢盆，可续写一个生活的歌单             \n" + "此刻，喜鹊的声音仍在拂动我的心弦           \n"
				+ "若什么都不可以估计，那就感叹向前吧         \n";
		myArticles[4] = new MyArticle("喜鹊", con4);

		String con5 = "当融化的积雪            \n" + "催开初绽的花蕾          \n" + "我愿拥抱你缤纷的身躯    \n"
				+ "喜闹在春光里            \n" + "只想对你说，永不分离    \n"
				+ "-                       \n" + "当立夏的脚步            \n"
				+ "唤醒丰收的欲望          \n" + "我愿怀揣绿色的梦幻      \n" + "走进湿热的风雨          \n"
				+ "用含情的目光            \n" + "向你诉说，永不分离      \n"
				+ "-                       \n" + "当丰收的喜悦            \n"
				+ "沉醉在枫红的秋色里      \n" + "我愿与你相拥            \n" + "漫步在铺满落叶的夕阳里  \n"
				+ "我用深情的目光          \n" + "向你诉说，永不分离      \n"
				+ "-                       \n" + "当银白的光阴            \n"
				+ "流淌在通往春天的路上    \n" + "也许你能感觉到          \n" + "我激动的心跳            \n"
				+ "当我向春天的路口        \n" + "深情的一瞥，你会听到    \n" + "我缠绵的心语            \n"
				+ "向你诉说，永不分离      \n";
		myArticles[5] = new MyArticle("永不分离", con5);

		String con6 = "酥酒春风赋川东，\n" + "绿雨桃花写杏红。\n" + "薄雾催开镜前月，\n" + "一剪金辉镀江中。\n";
		myArticles[6] = new MyArticle("怡红快绿", con6);

		String con7 =
				"曾有人说过，生活如一段录音，倾听午夜的独白，纵情灵魂的舞蹈；记忆如一截儿歌，纯真绚烂的往事，珍藏曾经的童谣；命运如一株蒿草，笑看天空的变幻，固守无助的孤傲。                                                                                      \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "生活中的我们，倘若仰望天空，就会觉得什么都比自己高，或许心生自卑；倘若能换俯视大地，便又觉什么都比自己低，又会自负；唯有放宽视野，把天空和大地尽收眼底，才能在苍穹泛土之间找到自己真正的位置。                                                    \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "不论今天多么的困难，都要坚信：只有回不去的过往，没有到不了的明天。你成不了心态的主人，必然会沦为情绪的奴隶。                                                                                                                                      \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "让我们心存美好的梦想，播下一个行动，收获一种习惯；播下一种习惯，收获一种性格；播下一种性格，收获一种命运。思想会变成语言，语言会变成行动，行动会变成习惯，习惯会变成性格。便会影响人生。                                                          \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "因为我怕输，所以我能忍。在这世上，能走的路有千万条，但适合我们走的却只有一条，别人走的不一定永远平坦，而自己走的路也不会永远曲折。                                                                                                                \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "我不去想是否能够成功，既然选择了远行便只顾风雨兼程；我不去想身后会不会袭来寒风冷雨，既然目标是彩虹桥，那么留给观众的只能是背影。                                                                                                                  \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "每天给自己一个希望，试着不为明天而烦恼，不为昨天而叹息，只为今天更美好；试着用希望迎接朝霞，用笑声送走余辉，用快乐涂满每个夜晚。                                                                                                                  \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "努力做一个不动声色的女人，花于无声处绽放最美，人于宁静里凝香愈浓；不喜于矫饰，不惯于张扬。与其华贵外表，不如优雅谈吐，容颜与时俱逝，内涵伴你不老。                                                                                                \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "不媚不扬，素雅恬淡，以婉约之势，只念一晌安暖，以一朵花开的明媚，在如水的光阴中展示最真实的自己。宁愿花时间去修炼不完美的自己，也不要浪费时间去期待完美的别人。                                                                                    \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "倘若心存梦想，自当勤勉以求。学习要加，骄傲要减，机会要乘，懒惰要除。唯行动是成功的阶梯，行动越多，攀登越高。古人有言曰：“临渊羡鱼，不如退而结网。”与其做一个有价钱的人，不如做一个有价值的人；与其做一个忙碌的人，不如做一个有效率的人。          \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "战胜自卑的唯一办法，就是自强，千万不要在别人看不起自己前，自己就先看低了自己。与其让那些想不通的问题在心中打结，还不如去想想明天的路该怎么走。                                                                                                    \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "有时候，失忆，是最好的解脱；沉默，是最好的诉说。                                                                                                                                                                                                  \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "都说，年轻是我们唯一拥有权利去编织梦想的时光。而理想成于坚韧，毁于急躁。在沙漠中，匆忙的旅人往往落在从容者的后边；疾驰的骏马在后头，缓步的骆驼继续向前。只有在逆风的方向，才能飞出倔强的坚强。                                                    \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "路再长也会有终点，夜再长也会有尽头，不管雨下得有多大，总会有停止的时候。乌云永远遮不住微笑的太阳！你的面前有阴影，那是因为你的背后有阳光。                                                                                                        \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "繁华历尽，方知平凡是真；回首沧桑，只想平淡如水。                                                                                                                                                                                                  \n"
						+ "                                                                                                                                                                                                                                                  \n"
						+ "但愿我们都可以在属于自己的日月中，用隐忍解读生命的坚强；用绽放诠释生命的绝美。                                                                                                                                                                    \n";
		myArticles[7] = new MyArticle("笑看人生峰高处，唯有磨难多正果", con7);

		String con8 = "有一黄毛小儿                    \n" + "乳臭未干                        \n"
				+ "立志打败所有奕林高手            \n" + "他自幼博览棋书                  \n"
				+ "历尽千辛万苦                    \n" + "练就了老玩童周伯通式的          \n"
				+ "左右手互博之术                  \n" + "自学成才                        \n"
				+ "                                \n" + "去年3月                         \n"
				+ "他找到韩国奕林第一人            \n" + "棋枰论道                        \n"
				+ "李世石1：4输了                  \n" + "                                \n"
				+ "后来他蒙面上了奕林之巅          \n" + "以一把快刀                      \n"
				+ "连续接受众多高手的车轮挑战      \n" + "无人可以抵挡                    \n"
				+ "谁也没见到他的庐山真面目        \n" + "最后还是他自揭面纱              \n"
				+ "黄毛小儿                        \n" + "阿尔法狗是也                    \n"
				+ "                                \n" + "今年的5月底                     \n"
				+ "他约战中国的第一人              \n" + "以慢制快、以静制动              \n"
				+ "柯杰能赢吗                      \n" + "我们拭目以待                    \n"
				+ "                                \n" + "阿尔法狗来了                    \n"
				+ "就在门外                        \n" + "我双腿盘膝                      \n"
				+ "坐在塌上                        \n" + "面对空棋盘                      \n"
				+ "盘算着                          \n" + "再造一个阿尔法狗                \n"
				+ "把门外的请进来                  \n" + "让他俩来个世纪之战              \n";
		myArticles[8] = new MyArticle("阿尔法狗来了", con8);

		String con9 =
				"人生，是一个苏醒的过程，生命就是一次历练，从鲜衣怒马，到银碗里盛雪，从青葱岁月到白发染鬓，人总是会在经历中成长，在经历中懂得，从而一步一步的走向成熟，修炼一颗波澜不惊的心。只有在不知何时的何时，蓦然回首，才发现人已不再是少年。  \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "有些事情，总来的那么突然，突然道让人不知所措，就像突然出现在手中的老照片。泪水瞬间攻占了眼眶，却是舍不得拭去。那年的我们，那年的笑容，那少年，仿若昨日，思绪一时间分乱了起来。                                                      \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日的我们兴致勃勃，逛遍了邢台市大大小小的商场，大街小巷都是我们的脚步。为一套衣服，为一个合影，为一份思念。事情如此简单，我们遍如此简单的行动，如此简单的快乐。                                                                \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日的我们说，毕业后大概就要相忘于江湖了，颇有几分豪情气概，却是根本不知江湖是何物，只是做着各自的梦，等着各自天涯或者叫各安天命。谁又晓得后来大浪淘沙，我们都被磨平了菱角，成了我们口中最鄙视的，没有个性，夹着尾巴做人的人。  \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "说天下没有不散的宴席，可当有天蓦然回首，却发现根本没有所念之人，只有那灯火阑珊。不知多少回风卷愁肠，花是流伤，叶是流伤。偶有飘然拂衣裳，思也彷徨，意也彷徨。不知从何时起，自己似乎不再那么羡慕天高地阔，只想留住身边仅剩的东西。    \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日妳说你写了篇日志，将我们都写了进去。妳是我们这一伙里唯一的女孩子，又是我们的姐姐，故而我们都依妳所言去看了一遍。当时觉得我们总算有了属于我们的故事，或者终于有人愿意相互把彼此留在彼此的记忆里。                            \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日你说咱们去旅游吧，你是伙里最爱折腾的人，那次是邢台大峡谷之行，我们随性的前行，浏览着沿途的风景。我们肆无忌惮的讨论，谁谁谁某某某，或好或坏，或喜或恶。我们都知道美的不是风景，而是我们在一起的时光。                        \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日你说咱们玩唬豹吧，作为最小的“团伙成员”，我本来是没想过你居然对酒桌上的游戏这么在行，那是大学期间最后一顿饭了吧，你如愿的喝趴了所有人，放肆的笑，挥霍着我们不知道还剩下多少的放肆。                                          \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日你拿来了吉他，作为宿舍的艺术家，你至少把我们那不多的艺术细胞发挥到了极致，虽然如今已经忘得差不多了，可那首被弹烂了的《挪威的森林》还是记在心里，也许以后还有机会……                                                          \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日你说喜欢上了那个小一届的姑娘，本来以为你是说说，直到后来看到你为她神伤，大家便开始为你出谋划策，虽然最后几乎用尽了办法也没有赢得姑娘的芳心，但以毕业在即的我们，有什么输不起的呢？                                          \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日我们回来，为了护士资格证，虽说理论上是很重要的考试，可大家见面后便也不是那么紧张了，当晚我们在宾馆互相考察着历年真题，似是在掩饰着自己的心虚。想想后来大家成功考取资格证后导员那诧异的表现，和我们的春风得意不禁莞尔。      \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "记得那日，记得那日我们正少年……                                                                                                                                                                                                      \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "转眼过去有四年了吧，我们各自闯荡，在各自的领域站稳脚跟。妳已经是孩子的母亲，你成了我们口中的老师，你也追求自己的梦想成了艺术家，剩下的三人也各自稳定了下来。                                                                        \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "也许现在看来，来路归处皆成苍茫，前顾回首失去了方向，自己是过河的卒子，还是盘中不由己的将，难以思量。却终难撒手放了这流年，不如就扔韶华三千，无论相聚离别都无言，终陌路做海天，轻辞做永远，笑一切胜负如烟。                          \n"
						+ "                                                                                                                                                                                                                                    \n"
						+ "那年的我们，那年的缘，不若当成此生难得荒唐这一回，管他清楚还是愚昧，落一子白黑，你笑我局中难退，设一路真伪，我笑你局中自围。                                                                                                        \n";
		myArticles[9] = new MyArticle("那日我们正少年", con9);
	}

	public Article getArticle(String username, String til, String content, String clafy) {
		String aid = CommonUtils.uuid();				//主键
		User author = getUserByUserName(username);			//外键, 表示博客属于谁(博主)
		String atitle = username + "的   " + til;			//文章标题
		String type = "原创";			//文章类型(原创, 转发, 翻译)
		String acontent = content;		//文章内容
		String classify = clafy;		//文章分类
		int end = content.length() < 100 ? content.length() : 100;
		String abstractContent = content.substring(0, end);	//文章摘要
		Long praiseNum = 0L;	//点赞数
		Long remarkNum = 0L;	//回复数
		Long readNum = 0L;		//阅读量
		Date atime = new Date();				//发表时间
		Integer verify = 0;		//审核字段, 0: 未审核 1: 通过 2: 未通过

		return new Article(aid, author, atitle, type, acontent, classify, abstractContent,
				praiseNum, remarkNum, readNum, atime, verify);
	}

}
